#include <Ints.h>
#include <SOURCE/ExpCampaign.h>
#include <SOURCE/X_GLOBAL.h>


char* xSetupCampaignGameHelp[X_GLOBAL_SETUP_HELP_COUNT] = {


    "{Старая кампания}\n\n"
        "Одна из двух кампаний за "
        "Роланда или Арчибальда "
        "из оригинальной игры "
        "Герои Меча и Магии II.",


    "{Новая кампания}\n\n"
        "Одна из четырех кампаний "
        "Цены Верности.",


    "{Отменить}\n\n"
        "Отменить и вернуться в "
        "главное меню."
};
char* xSetupStandardGameHelp[X_GLOBAL_SETUP_HELP_COUNT] = {


    "{Старая карта}\n\n"
        "Выбрать для игры карты "
        "старого формата Героев "
        "Меча и Магии II.",


    "{Новая карта}\n\n"
        "Выбрать для игры карты "
        "нового формата Цены "
        "Верности.",


    "{Отменить}\n\n"
        "Отменить и вернуться в "
        "главное меню."
};
char* xCampaignAwards[X_GLOBAL_EXPANSION_CAMPAIGN_AWARD_COUNT] = {
      "Союз эльфов",
      "Доспех",
      "Древесина",
      "Шлем",
      "Поражение Крегера",
      "Боевое одеяние",
      "Своенравный сын",
      "Дядя Иван",
      "Легендарный скипетр",
      "Ангел-хранитель",
      "Сфера антимагии"
};
char*
    xScenarioName[X_GLOBAL_EXPANSION_CAMPAIGN_COUNT][X_GLOBAL_EXPANSION_CAMPAIGN_MAP_COUNT] = {
        {  "Мятеж",
           "Земля Хаоса",
           "Полет стрелы",
           "Бездна",
           "Ущелье гиганта",
           "Аврора",
           "Смерть предателя",
           "Сердце порчи"},
        {  "Завоевание",
           "Граничные города",
           "Своенравный сын",
           "Чокнутый дядя Иван",
           "Южная война",
           "Бивень",
           "Земли эльфов",
           "Эпическая битва"},
        {  "Тайные острова",
           "Свитки вечности",
           "Нет власти",
           "Источник Силы",
         "",
         "",
         "",
         ""},
        {  "На мели",
           "Острова пиратов",
           "Король и страна",
           "Густая кровь",
         "",
         "",
         "",
         ""}
};
char*
    xScenarioDescription[X_GLOBAL_EXPANSION_CAMPAIGN_COUNT][X_GLOBAL_EXPANSION_CAMPAIGN_MAP_COUNT] =
        {
            {
                  "Усмирите\x20непокорных\x20мест"
                    "ных\x20баронов\x20и\x20тем\x20самым\x20"
                    "создайте\x20плацдарм\x2c\x20с\x20кот"
                    "орого\x20Империя\x20начнет\x20экс"
                    "пансию\x20в\x20этом\x20регионе\x2e",
                  "Подавите\x20любое\x20сопротивл"
                    "ение\x20в\x20окрестных\x20землях\x2e"
                    "\x20Только\x20после\x20этого\x20перв"
                    "ая\x20часть\x20артефакта\x20стане"
                    "т\x20вашей\x2e",
                  "Волшебницы\x20подняли\x20восст"
                    "ание\x20на\x20северо\x2dвостоке\x21\x20"
                    "По\x20дороге\x20в\x20горы\x20вы\x20долж"
                    "ны\x20для\x20блага\x20Империи\x20под"
                    "авить\x20их\x20жалкий\x20бунт\x2e",
                  "Готовясь\x20к\x20вашему\x20прибыт"
                    "ию\x2c\x20Крегер\x20собрал\x20вокруг"
                    "\x20себя\x20некромантов\x20и\x20прик"
                    "азал\x20им\x20преградить\x20вам\x20п"
                    "уть\x20к\x20заветной\x20цели\x2e\x20Вы\x20"
                    "должны\x20захватить\x20замок\x20С"
                    "кабсдейл\x20до\x20начала\x20треть"
                    "ей\x20недели\x2c\x20иначе\x20некрома"
                    "нты\x20усилятся\x20настолько\x2c\x20"
                    "что\x20станут\x20вам\x20не\x20по\x20зуб"
                    "ам\x2e",
                  "Вождь\x20варваров\x2c\x20который\x20"
                    "безраздельно\x20правит\x20в\x20эт"
                    "их\x20землях\x2c\x20пока\x20еще\x20не\x20п"
                    "одозревает\x20о\x20вашем\x20прису"
                    "тствии\x2e\x20Не\x20теряя\x20времени"
                    "\x2c\x20наращивайте\x20свои\x20силы\x2c"
                    "\x20прежде\x20чем\x20он\x20прознает\x20"
                    "о\x20вас\x20и\x20бросится\x20в\x20атаку"
                    "\x21\x20Уничтожьте\x20всех\x20врагов"
                    "\x20и\x20утвердите\x20свою\x20власть"
                    "\x20в\x20этой\x20стране\x2e",
                  "В\x20этом\x20регионе\x20силы\x20Импе"
                    "рии\x20невелики\x2e\x20Вам\x20все\x20ра"
                    "вно\x20не\x20удастся\x20одержать\x20"
                    "верх\x20над\x20всеми\x2c\x20кто\x20обит"
                    "ает\x20в\x20этих\x20землях\x2c\x20поэто"
                    "му\x20прибирайте\x20к\x20рукам\x2c\x20ч"
                    "то\x20сможете\x2c\x20пока\x20не\x20наст"
                    "ал\x20час\x20расплаты\x2e\x20Помните"
                    "\x2c\x20что\x20ваша\x20главная\x20цель\x20"
                    "–\x20заполучить\x20Шлем\x20Андура"
                    "на\x2e",
                  "Для\x20блага\x20Империи\x20вы\x20дол"
                    "жны\x20уничтожить\x20Крегера\x2e",
                  "Наконец\x2dто\x20у\x20вас\x20есть\x20и\x20"
                    "возможности\x2c\x20и\x20средства\x20"
                    "для\x20того\x2c\x20чтобы\x20навсегда"
                    "\x20избавить\x20Империю\x20от\x20нек"
                    "романтов\x2e\x20Уничтожьте\x20их\x20"
                    "всех\x20до\x20единого\x2c\x20и\x20ваше\x20"
                    "имя\x20будет\x20прославлено\x20в\x20"
                    "веках\x2e"
            },
            {
                  "Покорите\x20и\x20объедините\x20по"
                    "д\x20своей\x20властью\x20все\x20враж"
                    "дующие\x20племена\x2e\x20Герой\x20Жа"
                    "ркон\x2c\x20предок\x20многих\x20слав"
                    "ных\x20правителей\x2c\x20должен\x20о"
                    "статься\x20в\x20живых\x2e",
                  "Ваш\x20соперник\x2c\x20король\x20Гар"
                    "ондейла\x20подло\x20нападает\x20н"
                    "а\x20неукрепленные\x20погранич"
                    "ные\x20поселения\x21\x20Оправьтес"
                    "ь\x20от\x20первых\x20ударов\x20врага"
                    "\x2c\x20соберитесь\x20с\x20силами\x20и\x20"
                    "сотрите\x20его\x20с\x20лица\x20земли"
                    "\x21",
                  "Найдите\x20своего\x20блудного\x20"
                    "сына\x20Жозефа\x2c\x20который\x2c\x20по"
                    "\x20слухам\x2c\x20скрывается\x20в\x20да"
                    "льних\x20землях\x2e\x20Вы\x20должны\x20"
                    "отыскать\x20его\x20до\x20начала\x20т"
                    "ретьего\x20месяца\x2c\x20иначе\x20ди"
                    "настии\x20не\x20будет\x20от\x20него\x20"
                    "никакой\x20пользы\x2e",
                  "Выручите\x20из\x20беды\x20своего\x20"
                    "безумного\x20дядюшку\x20Ивана\x2e"
                    "\x20Вы\x20должны\x20найти\x20его\x20до\x20"
                    "начала\x20четвертого\x20месяца"
                    "\x2c\x20иначе\x20королевству\x20не\x20б"
                    "удет\x20от\x20него\x20никакой\x20пол"
                    "ьзы\x2e",
                  "Разгромите\x20варваров\x2c\x20кот"
                    "орые\x20совершают\x20набеги\x20на"
                    "\x20южные\x20рубежи\x20вашего\x20кор"
                    "олевства\x21\x20Для\x20начала\x20отб"
                    "ейте\x20захваченные\x20ими\x20гор"
                    "ода\x2c\x20а\x20затем\x20вторгнитесь"
                    "\x20в\x20их\x20царство\x2c\x20спрятанно"
                    "е\x20в\x20самом\x20сердце\x20джунгле"
                    "й\x2e\x20Ни\x20один\x20враг\x20не\x20долже"
                    "н\x20уйти\x20живым\x2e",
                  "Отбейте\x20у\x20врага\x20замок\x20Би"
                    "вень\x2c\x20который\x20пал\x2c\x20преда"
                    "нный\x20изменником\x2e",
                  "Заслужите\x20благосклонност"
                    "ь\x20эльфов\x2e\x20Они\x20не\x20позволя"
                    "т\x20рубить\x20деревья\x2c\x20поэтом"
                    "у\x20каждые\x20\x32\x20недели\x20мы\x20буд"
                    "ем\x20посылать\x20вам\x20древесин"
                    "у\x2e\x20Вы\x20должны\x20выполнить\x20з"
                    "адание\x20до\x20начала\x20седьмог"
                    "о\x20месяца\x2c\x20иначе\x20королевс"
                    "тво\x20обратится\x20в\x20руины\x2e",
                  "Грядет\x20последняя\x20и\x20решит"
                    "ельная\x20битва\x20с\x20вашим\x20изв"
                    "ечным\x20соперником\x20–\x20корол"
                    "евством\x20Гарондейл\x21\x20Пусть"
                    "\x20враг\x20умоется\x20кровью\x2c\x20но"
                    "\x20ваш\x20герой\x20Жаркон\x20\x56\x49\x20дол"
                    "жен\x20остаться\x20в\x20живых\x2e"
            },
            {
                  "Вам\x20необходимо\x20одержать\x20"
                    "верх\x20над\x20воинственными\x20м"
                    "агами\x2c\x20обитающими\x20на\x20вол"
                    "шебных\x20Сокрытых\x20Островах"
                    "\x2e\x20Победа\x20даст\x20вам\x20шанс\x20в"
                    "ыстоять\x20в\x20грядущих\x20битва"
                    "х\x20с\x20врагами\x2e",
                  "Теперь\x20вы\x20знаете\x2c\x20где\x20на"
                    "ходится\x20Великая\x20Библиоте"
                    "ка\x21\x20Смело\x20идите\x20вперед\x20и"
                    "\x20возьмите\x20штурмом\x20город\x20"
                    "Хронос\x2c\x20в\x20котором\x20стоит\x20"
                    "это\x20хранилище\x20древней\x20му"
                    "дрости\x2e",
                  "Найдите\x20Сферу\x20Забвения\x2c\x20"
                    "которая\x2c\x20по\x20слухам\x2c\x20сокр"
                    "ыта\x20где\x2dто\x20в\x20этих\x20землях"
                    "\x2e\x20Надписи\x20на\x20обелисках\x20п"
                    "омогут\x20вам\x20в\x20ваших\x20поиск"
                    "ах\x2e\x20Отыщите\x20Сферу\x20до\x20нач"
                    "ала\x20шестого\x20месяца\x2c\x20инач"
                    "е\x20ваши\x20соперники\x20доберут"
                    "ся\x20до\x20Источника\x20раньше\x20в"
                    "ас\x2e",
                  "Вы\x20должны\x20захватить\x20замо"
                    "к\x20чародеев\x2c\x20в\x20котором\x20на"
                    "ходится\x20Колдовской\x20Источ"
                    "ник\x2e\x20С\x20падением\x20замка\x20ва"
                    "ша\x20победа\x20станет\x20окончат"
                    "ельной\x2e",
                "",
                "",
                "",
                ""
            },
            {
                  "Чтобы\x20построить\x20корабль\x20"
                    "и\x20добраться\x20до\x20материка\x2c"
                    "\x20вам\x20надо\x20захватить\x20горо"
                    "д\x20на\x20острове\x20у\x20северо\x2dво"
                    "сточного\x20побережья\x2e\x20Геро"
                    "й\x20Галлавант\x20должен\x20остат"
                    "ься\x20в\x20живых\x2e",
                  "Найдите\x20и\x20разгромите\x20Мар"
                    "тина\x2c\x20предводителя\x20пират"
                    "ов\x2c\x20обосновавшегося\x20в\x20Пи"
                    "ратской\x20Бухте\x2e\x20Галлавант"
                    "\x20должен\x20остаться\x20в\x20живых"
                    "\x2c\x20иначе\x20все\x20будет\x20потеря"
                    "но\x2e",
                  "Уничтожьте\x20всех\x2c\x20кто\x20не\x20"
                    "признает\x20власти\x20Лорда\x20Ал"
                    "ьберона\x2e\x20Галлавант\x20долже"
                    "н\x20остаться\x20в\x20живых\x2e",
                  "Положите\x20конец\x20самовласт"
                    "ью\x20Лорда\x20Альберона\x20и\x20зах"
                    "ватите\x20все\x20принадлежащие"
                    "\x20ему\x20земли\x2e\x20Галлавант\x20до"
                    "лжен\x20остаться\x20в\x20живых\x2e",
                "",
                "",
                "",
                ""
            }
        };
char* xShortCampaignNames[X_GLOBAL_EXPANSION_CAMPAIGN_COUNT] = {
      "ЦВ",
      "НАС",
      "ЧАР",
      "ДОМ"
};
char* xHSCampaignNames[EXPANSION_HIGH_SCORE_CAMPAIGN_COUNT] = {
      "Цена\x20верности\x20",
      "Наследники",
      "Остров\x20чародеев",
      "Дорога\x20домой"
};
char* xRecruitEmpty[X_GLOBAL_RECRUIT_EMPTY_COUNT] = {
      "Это\x20захоронение\x20таит\x20сме"
        "ртельную\x20тишину\x2e",
      "Яма\x20клокочущей\x20грязи\x20вск"
        "олыхнулась\x20и\x20успокоилась"
        "\x2e",
      "Вы\x20вошли\x20в\x20здание\x20из\x20огр"
        "омных\x20белых\x20камней\x20и\x20нич"
        "его\x20не\x20нашли\x20внутри\x2e",
      "Ни\x20один\x20из\x20огненных\x20элем"
        "енталов\x20не\x20вышел\x20вам\x20нав"
        "стречу\x20из\x20огненного\x20басс"
        "ейна\x2e",
      "На\x20мгновение\x20в\x20воде\x20мель"
        "кнули\x20черты\x20чьих\x2dто\x20лиц\x20"
        "и\x20исчезли\x2e"
};
char* xRecruitBuy[X_GLOBAL_RECRUIT_BUY_COUNT] = {
      "Неупокоенные\x20духи\x20давно\x20"
        "погибших\x20воинов\x20ищут\x20усп"
        "окоения\x20и\x20соглашаются\x20вс"
        "тупить\x20в\x20вашу\x20армию\x20в\x20на"
        "деже\x20найти\x20упокоение\x2e\x20Же"
        "лаете\x20нанять\x20призраков\x3f",
      "Как\x20только\x20вы\x20подошли\x20к\x20"
        "яме\x20клокочущей\x20грязи\x20из\x20"
        "нее\x20начали\x20выползать\x20сущ"
        "ества\x2e\x20Встав\x20вокруг\x20ямы\x2c"
        "\x20они\x20в\x20унисон\x20обратились"
        "\x20к\x20вам\x3a\x20\x22Мать\x20Земля\x20жела"
        "ет\x20предложить\x20вам\x20нескол"
        "ьких\x20своих\x20воинов\x2e\x20Желае"
        "те\x20нанять\x20земных\x20элемент"
        "алов\x3f\x22",
      "Белокаменные\x20колонны\x20под"
        "пирают\x20крышу\x2c\x20уходящую\x20в"
        "\x20небеса\x2e\x20Едва\x20вы\x20вошли\x20в"
        "нутрь\x2c\x20как\x20спокойный\x20воз"
        "дух\x20превратился\x20в\x20мощный"
        "\x20поток\x20ветра\x2c\x20едва\x20не\x20вы"
        "толкнувший\x20вас\x20наружу\x2e\x20В"
        "оздух\x20сгустился\x20в\x20едва\x20р"
        "азличимые\x20формы\x2e\x20Существ"
        "о\x20обратилось\x20вам\x20едва\x20сл"
        "ышимым\x20шепотом\x3a\x20\x22Зачем\x20т"
        "ы\x20явился\x20сюда\x3f\x20Ты\x20пришел"
        "\x20сюда\x20искать\x20помощи\x20сил\x20"
        "воздуха\x3f\x22",
      "В\x20постройке\x2c\x20удерживающе"
        "й\x20раскаленную\x20лаву\x20вы\x20ви"
        "дите\x20огненных\x20элементало"
        "в\x2c\x20движущихся\x20в\x20потоках\x20"
        "раскаленной\x20лавы\x2e\x20Нескол"
        "ько\x20из\x20них\x20подошли\x20к\x20вам"
        "\x20и\x20предложили\x20вам\x20свою\x20с"
        "лужбу\x2e\x20Желаете\x20нанять\x20ог"
        "ненных\x20элементалов\x3f",
      "Хрустальные\x20постройки\x20от"
        "брасывают\x20зыбкие\x20тени\x20на"
        "\x20небольшой\x20сверкающий\x20ба"
        "ссейн\x2e\x20В\x20воде\x20появилось\x20"
        "лицо\x2c\x20не\x20ваше\x20отражение\x2c"
        "\x20которое\x20обратилось\x20к\x20ва"
        "м\x20со\x20словами\x3a\x20\x22Желаешь\x20о"
        "братиться\x20за\x20помощью\x20к\x20с"
        "илам\x20воды\x3f\x22"
};
char* xNecromancerShrine =
      "Темная\x20святыня";
char* xNecromancerShrineDesc =
      "Увеличивает\x20уровень\x20навы"
        "ка\x20Некромантии\x20каждого\x20в"
        "ашего\x20некроманта\x20на\x20\x31\x30\x20п"
        "роцентов\x2e";
char* xStableText[X_GLOBAL_STABLE_TEXT_COUNT] = {
      "Старший\x20конюх\x20подошел\x20к\x20"
        "вам\x20со\x20словами\x3a\x20\x22У\x20вас\x20о"
        "тличный\x20конь\x20под\x20седлом\x20"
        "и\x20в\x20вашей\x20армии\x20нет\x20неоп"
        "ытных\x20всадников\x2c\x20кого\x20мы"
        "\x20могли\x20бы\x20обучить\x20искусс"
        "тву\x20управления\x20боевыми\x20с"
        "какунами\x2e\x22",
      "Появился\x20старший\x20конюх\x2c\x20"
        "ведущий\x20отличного\x20боевог"
        "о\x20скакуна\x2e\x20\x22Этот\x20конь\x20по"
        "может\x20вам\x20быстрее\x20добрат"
        "ься\x20до\x20нужного\x20места\x2e\x20Но"
        "\x20его\x20выносливости\x20хватит"
        "\x20на\x20неделю\x2e\x20У\x20нас\x20есть\x20е"
        "ще\x20такие\x20кони\x2c\x20но\x20у\x20вас\x20"
        "нет\x20всадников\x2e\x22",
      "Старший\x20конюх\x20сказал\x20вам"
        "\x3a\x20\x22У\x20вас\x20превосходный\x20ко"
        "нь\x2e\x20Мы\x20не\x20можем\x20помочь\x20в"
        "ам\x2e\x20Но\x20у\x20ваших\x20всадников"
        "\x20не\x20породистые\x20кони\x2e\x20У\x20н"
        "ас\x20есть\x20отличные\x20боевые\x20"
        "скакуны\x20для\x20них\x2e\x22",
      "Появился\x20старший\x20конюх\x2c\x20"
        "ведущий\x20отличных\x20боевых\x20"
        "скакунов\x2e\x20\x22Этот\x20конь\x20пом"
        "ожет\x20вам\x20быстрее\x20добрать"
        "ся\x20до\x20нужного\x20места\x2c\x20но\x20"
        "его\x20сил\x20хватит\x20на\x20\x37\x20дней"
        "\x2e\x20К\x20тому\x20же\x2c\x20мы\x20можем\x20да"
        "ть\x20новых\x20коней\x20и\x20вашим\x20в"
        "садникам\x2e\x22"
};
char* xJosephName[X_GLOBAL_EXPANSION_HERO_NAME_COUNT] = {
      "Джозеф",
      "Джозеф\x20\x49\x49",
      "Джозеф\x20\x49\x49\x49",
      "Джозеф\x20\x49\x56",
      "Джозеф\x20\x56",
      "Джозеф\x20\x56\x49"
};
char* xUncleIvanName[X_GLOBAL_EXPANSION_HERO_NAME_COUNT] = {
      "Дядя\x20Иван",
      "Иван\x20\x49\x49",
      "Иван\x20\x49\x49\x49",
      "Иван\x20\x49\x56",
      "Иван\x20\x56",
      "Иван\x20\x56\x49"
};
char* xShortSSLevelNames[X_GLOBAL_SHORT_SKILL_LEVEL_COUNT] = {
      "\x31\x20ступ\x2e",
      "\x32\x20ступ\x2e",
      "\x33\x20ступ\x2e"
};
char* xPasswordStrings[X_GLOBAL_PASSWORD_STRING_COUNT] = {
      "Продвижение",
      "Наступление",
      "Странствие",
      "Живой",
      "Стрелок",
      "Арена",
      "Броня",
      "Армия",
      "Стрела",
      "Артефакт",
      "Влечение",
      "Тайный",
      "Варвар",
      "Барон",
      "Битва",
      "Берсерк",
      "Кузница",
      "Клинок",
      "Благословение",
      "Ослепление",
      "Башмаки",
      "Доспех",
      "Защищать",
      "Капитан",
      "Замок",
      "Катапульта",
      "Собор",
      "Котел",
      "Кавалерия",
      "Кентавр",
      "Чемпион",
      "Чары",
      "Накидка",
      "Гроб",
      "Приказ",
      "Управление",
      "Прятаться",
      "Производить",
      "Герб",
      "Арбалет",
      "Толпа",
      "Крипта",
      "Кристалл",
      "Проклятие",
      "Циклоп",
      "Кинжал",
      "Урон",
      "Тьма",
      "Смерть",
      "Десятина",
      "Твердый",
      "Поражение",
      "Демон",
      "Пустыня",
      "Уничтожить",
      "Разрушение",
      "Отступить",
      "Измерение",
      "Дипломатия",
      "Открыть",
      "Разрушение",
      "Дистанция",
      "Дракон",
      "Друид",
      "Подземелье",
      "Гном",
      "Жилище",
      "Землетрясение",
      "Элементал",
      "Эликсир",
      "\x45\x6c\x76\x65\x6e",
      "Символ",
      "Атаковать",
      "Ярость",
      "Угощать",
      "Зло",
      "Страх",
      "Огонь",
      "БУКА",
      "Цеп",
      "Фляга",
      "Наводнение",
      "Цветок",
      "Фонтан",
      "Удача",
      "Горгулья",
      "Перчатка",
      "Самоцвет",
      "Джинн",
      "Призрак",
      "Гигант",
      "Перчатки",
      "Гоблин",
      "Золото",
      "Голем",
      "Кладбище",
      "Опасность",
      "Стража",
      "Гильдия",
      "Алебарда",
      "Молот",
      "Арфа",
      "Запустение",
      "Шлем",
      "Герой",
      "Честь",
      "Надежда",
      "Орда",
      "Лошадь",
      "Подкова",
      "Гидра",
      "Опознать",
      "Зажигать",
      "Иллюзия",
      "Невидимость",
      "Королевство",
      "Нож",
      "Рыцарство",
      "Ланс",
      "Фонарь",
      "Лидерство",
      "Кожа",
      "Независимость",
      "Ленник",
      "Жизнь",
      "Молния",
      "Лорд",
      "Палица",
      "Маг",
      "Магия",
      "Величество",
      "Злоба",
      "Медуза",
      "Метеорит",
      "Сила",
      "Минотавр",
      "Ежеминутный",
      "Стрелка",
      "Монстр",
      "Мумия",
      "Навигация",
      "Некромантия",
      "Ничего",
      "Огр",
      "Мазь",
      "Паладин",
      "Паралич",
      "Отбитие",
      "Разделять",
      "Феникс",
      "Портал",
      "Напиток",
      "Кошель",
      "Сумка",
      "Власть",
      "Пирамида",
      "Задание",
      "Радуга",
      "Рейнджер",
      "Нанять",
      "Спасти",
      "Воскрешение",
      "Отступить",
      "Праведность",
      "Халат",
      "Разбойник",
      "Веревка",
      "Ножны",
      "Скарабей",
      "Сабля",
      "Свиток",
      "Щит",
      "Глас",
      "Святилище",
      "Осада",
      "Скелет",
      "Навык",
      "Убийца",
      "Праща",
      "Колдунья",
      "Скорость",
      "Посох",
      "Статуя",
      "Шторм",
      "Сера",
      "Вызвать",
      "Болото",
      "Меч",
      "Телепатия",
      "Страх",
      "Гром",
      "Факел",
      "Башня",
      "Пародия",
      "Соглашение",
      "Трезубец",
      "Тролль",
      "Единорог",
      "Вампир",
      "Яд",
      "Победа",
      "Вулкан",
      "Уязвимость",
      "Жезл",
      "Война",
      "Чернокнижник",
      "Оружие",
      "Крылья",
      "Волшебство",
      "Волк",
      "Зомби"
};
i8 xNetHasOldPlayers = 0;
u8 xNewHeroAlignment[X_GLOBAL_NEW_HERO_ALIGNMENT_COUNT] = {
    (FACTION_KNIGHT),
    (FACTION_KNIGHT),
    (FACTION_NECROMANCER),
    (FACTION_BARBARIAN),
    (FACTION_WIZARD),
    (FACTION_SORCERESS),
    (FACTION_KNIGHT),
    (FACTION_KNIGHT),
    (FACTION_NECROMANCER),
    (FACTION_BARBARIAN),
    (FACTION_WARLOCK),
    (FACTION_KNIGHT)
};
i32
    xShrineBuildingCost[X_GLOBAL_BUILDING_RESOURCE_COUNT] = {10, 0, 0, 0, 10, 0, 4000};
i32 xPasswordStringsIndex[X_GLOBAL_PASSWORD_STRING_INDEX_COUNT];
i8 xIsExpansionMap;
ExpansionCampaignId xLastChoice;
u8 xIsPlayingExpansionCampaign;
ExpCampaign xCampaign;

i32 xTheSpell;
